# ColorSelectionDialog Members (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ColorSelectionDialog Members
ColorSelectionDialog Class Constructors Methods Properties See Also
---
The ColorSelectionDialog type exposes the following members.
# Constructors
| Name | Description |
| --- | --- |
| --- | --- | --- |
| ColorSelectionDialog | Default constructor. |

# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose | Releases all resources used by the ColorSelectionDialog |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| Show | Shows the Revit Color dialog as a modal dialog. |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| OriginalColor | The original color. |
| SelectedColor | The new color selected by the user. |

# See Also
ColorSelectionDialog Class
Autodesk.Revit.UI Namespace